# **#5 Membalik Urutan baris dan kolom pada Data Frame**

In [7]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

Pengenalan Data Frame

In [9]:
#jumlah baris
n_rows = 5
#jumlah kolom
n_cols = 5
#kolom tersebut diberi nama ABCDE
cols = tuple('ABCDE')

#Membuat data frame dengan nilai acak antara 1 sampai 10
df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), 
                  columns=cols)

#Menampilkan data frame yang telah dibuat 
df

   A  B  C  D  E
0  6  6  1  1  3
1  7  8  4  8  5
2  6  5  7  4  5
3  8  7  5  5  4
4  6  3  6  6  6

Membalik urutan kolom

In [11]:
#Baris pertama untuk mengatur baris dan baris kedua untuk mengatur kolom
df.loc[:,::-1]

   E  D  C  B  A
0  3  1  1  6  6
1  5  8  4  8  7
2  5  4  7  5  6
3  4  5  5  7  8
4  6  6  6  3  6

Membalik urutan baris

In [13]:
#Tidak perlu menyertakan ruas kedua
df.loc[::-1]

   A  B  C  D  E
4  6  3  6  6  6
3  8  7  5  5  4
2  6  5  7  4  5
1  7  8  4  8  5
0  6  6  1  1  3

Membalik urutan baris dan melakukan penyesuaian ulang indexs

In [15]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  3  6  6  6
1  8  7  5  5  4
2  6  5  7  4  5
3  7  8  4  8  5
4  6  6  1  1  3

# **#06 Mengganti Nama (label) Kolom pada Data Frame**

Import Modules

In [23]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

Persiapan Data Frame

In [33]:
#jumlah baris
n_rows = 5
#jumlah kolom
n_cols = 5
#Kolom tersebut diberi nama ABCDE
cols = tuple('ABCDE')

#Membuat data frame dengan nilai acak antara 1 dan 10 
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)

#Menampilkan data frame yang telah dibuat 
df

   A  B  C  D  E
0  6  3  5  3  5
1  8  5  8  2  2
2  8  9  9  9  8
3  4  4  4  8  5
4  1  3  8  5  1

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [35]:
#Mengganti nama kolom C menjadi kolom Hobi
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  6  3     5  3  5
1  8  5     8  2  2
2  8  9     9  9  8
3  4  4     4  8  5
4  1  3     8  5  1

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [37]:
#Mengganti nama kolom A menjadi Nama, kolom B menjadi Alamat dan kolom D menjadi Kota
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     6       3  5     3  5
1     8       5  8     2  2
2     8       9  9     9  8
3     4       4  4     8  5
4     1       3  8     5  1

# **#07 Menghapus (drop) missing values (NaN)**

import modules

In [39]:
import pandas as pd 

print(pd.__version__)

2.2.2

Persiapan Data Frame

In [45]:
#Depricated
#df = pd.util.testing.makeMissingDataframe().reset_index()
#df.head()

In [49]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) <0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0 -1.122162       NaN  0.427369  2.770339
1      1       NaN       NaN       NaN       NaN
2      2  0.355563 -1.420557 -0.226703  0.232229
3      3 -0.899073 -1.133705 -0.532477 -0.170932
4      4 -2.145413 -0.302775  0.297463       NaN

In [53]:
#Menggunakan metode rename untuk mengganti nama indeks dari 'index' menjadi 'Z' dalam Data Frame
df = df.rename(columns={'index':'Z'})

#Menampilkan 5 data awal dari data frame setelah perubahan nama indeks
df.head()

   Z         A         B         C         D
0  0 -1.122162       NaN  0.427369  2.770339
1  1       NaN       NaN       NaN       NaN
2  2  0.355563 -1.420557 -0.226703  0.232229
3  3 -0.899073 -1.133705 -0.532477 -0.170932
4  4 -2.145413 -0.302775  0.297463       NaN

In [57]:
#Membuat salinan mendalam dari data frame df dan menyimpannya dalam variable df_backup
df_backup = df.copy(deep=True)

Menghapus (drop) setiap kolom yang mengandung missing values

In [63]:
#Membuat salinan mendalam dari data frame df_backup dalam variable df
df = df.dropna(axis='columns')

#Untuk menampilkan hasilnya
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

Menghapus (drop) setiap baris yang mengandung missing values

In [67]:
#Membuat salinan mendalam dari data frame df_backup dalam variable df
df = df_backup.copy(deep=True)

#Menghapus rows yang missing values 
df = df.dropna(axis='rows')

#Untuk menampilkan hasilnya 
df.head()

     Z         A         B         C         D
2    2  0.355563 -1.420557 -0.226703  0.232229
3    3 -0.899073 -1.133705 -0.532477 -0.170932
8    8  0.876420 -1.823726  0.604119  1.235695
10  10 -0.577720 -1.155976  1.025370  0.809916
11  11 -0.294183 -1.098874  0.110720  1.148230

Persentase missing values untuk tiap kolom

In [69]:
#Membuat salinan mendalam dari data frame df_backup dalam variable df
df = df_backup.copy(deep=True)

#Mengumpulkan semua missing value untuk setiap kolom dari Data Frame
#.mean berfungsi untuk Mengkalkulasi rata rata dari misisng value yang dimiliki setiap kolom dari Data Frame
df.isna().mean()

Z    0.000000
A    0.133333
B    0.300000
C    0.166667
D    0.233333
dtype: float64

Menghapus (drop) setiap kolom yang mengandung misisng values berdasarkan threshold

In [75]:
#Tentukan ambang batasnya, disini 90% 
treshold = len(df) * 0.9

#Proses dropping 
df = df.dropna(thresh=treshold, axis='columns')

#untuk menampilkan hasilnya
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

# **#08 Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame**

Import modules

In [77]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

Persiapan Data Frame

In [79]:
#Membuat data frame dengan menggunakan dictionary sebagai sumber datanya 
#Data frame memiliki dua kolom, A dan B dengan beberapa nilai NoN (Not a Number) 
data = {'A':[15, 15, 18, np.nan, 12],
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)

#Menampilkan data frame yang telah dibuat 
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [91]:
#Menggunakan fungsi type untuk mengetahui tipe objek dari kolom A dalam data frame
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [87]:
#Menggunakan fungsi type untuk mengetahui tipe objek dari kolom A dalam data frame
type(df['A'])

pandas.core.series.Series

In [89]:
#Menggunakan fungsi type untuk mengetahui tipe objek dari data frame
type(df)

pandas.core.frame.DataFrame

Memeriksa kesamaan dengan operator ==

In [95]:
#Untuk membandingkan nilai antara kolom A dan B menggunakan operator ==
#Setiap baris akan di bandingkan
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [97]:
#Metode ini dapat menangani perbandingan nilai NoN dengan benar
df['A'].equals(df['B'])

True

Memeriksa kesamaan antar dua Data Frame

In [99]:
#Membuat salinan mendalam dari data frame df dan menyimpannya dalam variable df1
df1 = df.copy(deep=True)

#Menggunakan metode equals untuk memeriksa apakah isi dari df dan df1 identik 
#Metode ini dapat menangani perbandingan nilai NoN dnegan benar 
df.equals(df1)

True

In [101]:
#Menggunakan operator == untuk membandingkan nilai antara setiap elemen dalam df dan df1
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True